In [1]:
import sqlite3
import pandas as pd

In [3]:
df = pd.read_csv('train.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [5]:
c = sqlite3.connect('train.sqlite')
cursor = c.cursor()

In [7]:
cursor.execute('CREATE TABLE train (id INTEGER PRIMARY KEY AUTOINCREMENT, PassengerId INTEGER, Survived INTEGER, Pclass INTEGER, Name TEXT, Sex TEXT, SibSp INTEGER, Parch INTEGER, Ticket TEXT, Fare INTEGER, Cabin TEXT, Embarked TEX)')

In [8]:
for row in cursor.execute("SELECT name FROM sqlite_master WHERE type= 'table';"):
    #type='table' is a sqlite item, where you'd normally pass in tables
    print(row)

('train',)
('sqlite_sequence',)

In [9]:
train = pd.read_sql_query("SELECT * FROM train", c)

In [10]:
train.head(2)

Empty DataFrame
Columns: [id, PassengerId, Survived, Pclass, Name, Sex, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [12]:
cursor.execute('INSERT INTO train VALUES(1, 0, 3, "Braund, Mr. Owen Harris", "male", 22.0, 1, 0, "A/5 21171", 7.2500, "NaN", "S")')

In [14]:
train = pd.read_sql_query("SELECT * FROM train", c)
train.head(2)

,id,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S